package com.example.dmitry.whoisunwanted;

/**
 * Created by Dmitry on 01.04.2017.
 */

public class Answers {
    String[][] answers;
    public Answers(){
        answers = new String[][]{
                {"4" , "Не домашнее животное"},
                {"2" , "Два колеса"},
                {"1" , "Мягкий"},
                {"3" , "Млекопитающее"},
                {"3" , "Лимон кислый"},
                {"1" , "Работает на дизиле"},
                {"4" , "Не отряд кошачьих"},
                {"2" , "Не дает молока"},
                {"4" , "Не живет на севере"},
                {"4" , "Газель не плотоядная"},
                {"1" , "Работает без электричества"},
                {"1" , "Бразилия не в Европе"},
                {"3" , "Не оружие"},
                {"2" , "Не профессия"},
                {"4" , "Кукуруза не животного происхождения"},
                {"2" , "Создана природой"},
                {"1" , "Существование доказано"},
                {"3" , "Созданно человеком"},
                {"2" , "Не плавает"},
                {"3" , "Золото не горит"},
                {"4" , "Не дает света"},




        };
    }

    public int getLengt(){
        return answers.length;
    }

    public String[] getAnswers(int numberQutstion) {
        return answers[numberQutstion - 1];
    }
}
